#+PROPERTY: header-args:R  :session *R:cretaceous-constraints* :exports results :results output :eval no-export
#+options: TOC:nil
* COMMENT libs
#+begin_src R :exports code
  library(tidyverse)
  library(patchwork)
  theme_set(theme_bw())
#+end_src

#+RESULTS:
#+begin_example
── Attaching core tidyverse packages ───────────────────────────────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.2     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.3     ✔ tibble    3.2.1
✔ lubridate 1.9.2     ✔ tidyr     1.3.0
✔ purrr     1.0.2
── Conflicts ─────────────────────────────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors
#+end_example

* COMMENT reproduce [cite:@Ma2017] steps
:PROPERTIES:
:CREATED:  [2023-08-28 Mon 10:52]
:END:
Load the R package Astrochron
This analysis uses version 0.6.6. Please use versions >= 0.6.6.

#+begin_src R
  library(astrochron)
#+end_src

#+RESULTS:
: Welcome to astrochron v1.2 (2023-08-25)
:  Type ?astrochron to learn more

* COMMENT read [cite:@ZeebeLourens2019,@ZeebeLourens2022] to reproduce their approach
:PROPERTIES:
:CREATED:  [2023-08-28 Mon 11:56]
:END:
:LOGBOOK:
CLOCK: [2023-08-28 Mon 17:02]--[2023-08-28 Mon 17:10] =>  0:08
CLOCK: [2023-08-28 Mon 14:55]--[2023-08-28 Mon 17:02] =>  2:07
- try to reproduce, cannot figureit out?
CLOCK: [2023-08-28 Mon 14:10]--[2023-08-28 Mon 14:55] =>  0:45
- do 2.4 Myr analysis on ZB18a
CLOCK: [2023-08-28 Mon 11:20]--[2023-08-28 Mon 12:08] =>  0:48
:END:

Richard's code
#+begin_src matlab
f  = 1./2000;
df = 0.6;

yf{i} = gaussfilter(t{i},y{i},f,df*f,2*df*f,0.0);

[~,ix{i}] = findpeaks(-yf{i});
kv = ix{i};
dt{i} = diff(t{i}(kv));
#+end_src


#+begin_src R
  library(tidyverse)

  # get orbital solution sol
  sol <- snvecR::get_ZB18a() |>
    select(age, ee)

  # Do the same as Zeebe and Lourens 2022:
  # filter 2 Myr ± 60% Gaussian
  # 2 Myr = 2000 kyr period = 1 / 2000 period
  x11(type = "cairo")
  bp2000 <- sol |>
    astrochron::bandpass(
                  padfac = 10, # 10x the number of data points
                  # parameterized as I understand Richard's matlab code
                  # this doesn't make any sense to me
                  ## flow = 0.6 * 1 / 2000,
                  ## fhigh = 2 * 0.6 * 1 / 2000,
                  flow = 1 / 2000 - 0.6 * 1 / 2000,
                  fhigh = 1 / 2000 + 0.6 * 1 / 2000,
                  win = 1, # Gaussian window
                  demean = TRUE, detrend = TRUE, #???
                  addmean = FALSE,
                  xmax = .02)
  grDevices::savePlot("imgs/2023-08-28_0_2Myr_bandpass_filter.png")

  # get the peak maxima
  pk2000 <- bp2000 |>
    astrochron::peak()
  grDevices::savePlot("imgs/2023-08-28_1_peak.png")

  # but in the paper they do peak minima, we just flip the input
  pk2000_flip <- bp2000 |>
    mutate(ee = -ee) |>
    astrochron::peak(genplot = TRUE)
  grDevices::savePlot("imgs/2023-08-28_2_peak.png")

  # calculate deltas between peaks
  pk2000_tidy <- pk2000 |>
    as_tibble() |>
    # different ways to calculate the delta
    mutate(delta_vln_lag = Location - lag(Location)) |> # this one minus previous one
    mutate(delta_vln = lead(Location) - Location) # next one minus this one
  pk2000_flip_tidy <- pk2000_flip |>
    as_tibble() |>
    mutate(delta_vln_lag = Location - lag(Location)) |>
    mutate(delta_vln = lead(Location) - Location)

  # check that peak id has gone well
  bp2000 |>
    ggplot(aes(x = age, y = ee)) +
    geom_line() +
    geom_point(aes(x = Location, y = Peak_Value, colour = "maxima"), data = pk2000_tidy) +
    geom_point(aes(x = Location, y = -Peak_Value, colour = "minima"), data = pk2000_flip_tidy)
  ggsave("~/SurfDrive/Postdoc1/prj/2023-05-19_cretaceous/imgs/2023-08-28_3_check_peaks.png")

  # create a plot similar to Zeebe and Lourens 2022 EPSL figure 6a
  pk2000_tidy |>
    ggplot(aes(x = Location / 1000, y = delta_vln / 1000)) +
    ## geom_point(aes(colour = "maxima lead")) +
    ## geom_line(aes(colour = "maxima lead")) +
    geom_point(aes(colour = "minima lead"), data = pk2000_flip_tidy) +
    geom_line(aes(colour = "minima lead"), data = pk2000_flip_tidy) +
    # did they use the half-distance? nope
    ## geom_point(aes(x = (Location + .5 * (lead(Location) - Location)) / 1000, colour = "minima lead"), data = pk2000_flip_tidy) +
    ## geom_line(aes(x = (Location + .5 * (lead(Location) - Location)) / 1000, colour = "minima lead"), data = pk2000_flip_tidy) +
    ## geom_point(aes(y = delta_vln_lag / 1000, colour = "maxima lag")) +
    ## geom_line(aes(y = delta_vln_lag / 1000, colour = "maxima lag")) +
    ## geom_point(aes(y = delta_vln_lag / 1000, colour = "minima lag"), data = pk2000_flip_tidy) +
    ## geom_line(aes(y = delta_vln_lag / 1000, colour = "minima lag"), data = pk2000_flip_tidy) +
    labs(x = "Age (Ma)",
         y = Delta[VLN] ~ "Interval between min/max in 2-Myr ecc filter (Myr)") +
    scale_x_continuous(breaks = seq(40, 80, 5)) +
    coord_cartesian(xlim = c(44, 70), ylim = c(0, 3))

  ggsave("imgs/2023-08-28_4_Dvln.png", width = 8, height = 3)
  ## ggsave("~/SurfDrive/Postdoc1/prj/2023-05-19_cretaceous/imgs/2023-08-28_4_Dvln.png")
#+end_src

#+RESULTS:
#+begin_example

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 250001
 ,* Sample interval= 0.4
 ,* Mean value removed= 0.02683078
 ,* Center of bandpass filter = 5e-04
 ,* 600 pos/neg frequency pairs will be bandpassed

----- FINDING MAXIMA OF PEAKS, FILTERING AT THRESHOLD VALUE -----
 ,* Number of data points= 250001
 ,* Number of columns= 2
 ,* Identifying maxima of peaks
 ,* Number of peaks identified= 50

 ,* No filtering of peaks applied.

----- FINDING MAXIMA OF PEAKS, FILTERING AT THRESHOLD VALUE -----
 ,* Number of data points= 250001
 ,* Number of columns= 2
 ,* Identifying maxima of peaks
 ,* Number of peaks identified= 51

 ,* No filtering of peaks applied.
Saving 7 x 6.99 in image
Warning messages:
1: Removed 1 rows containing missing values (`geom_point()`).
2: Removed 1 row containing missing values (`geom_line()`).
Warning messages:
1: Removed 1 rows containing missing values (`geom_point()`).
2: Removed 1 row containing missing values (`geom_line()`).
#+end_example

**** splice table from [cite:@Westerhold2008] PDF
maybe this one?
https://doi.pangaea.de/10.1594/PANGAEA.592301

another PDF :S
[[file:~/Downloads/208-1267_TabS7_tie_points.pdf]]

this has hole core section interval depth_mbsf depth_rmcd
tie to / append to / end of splice
new mbsf / rmcd

manually converted to csv again (this one was a bit easier than the one with many sites)

this links hole A to hole B and vice-versa
depth_mbsf from 25.2 m to 329
depth_rmcd from 28.6 m to 367 m

same as shipboard MCD above 180.25 MCD, adjusted below

#+begin_src R
  # the full splice table
  rmcd <- readr::read_csv("dat/ODP208_1267_rmcd.csv") |>
    separate(label, into = c("sitehole", "coretype", "Sec"),
               sep = "-", remove = FALSE) |>
    separate(sitehole, into = c("Site", "H"), sep = -1) |>
    separate(coretype, into = c("Core", "T"), sep = -1) |>
    # we do not rename the interval, may not be the same as in the data!
    # rename the CC sections into 7, the naming convention in the MS data
    mutate(Sec = ifelse(Sec == "7", "7", Sec),
           Sec = ifelse(Sec == "cc", "7", Sec)) |>
    mutate(diff = depth_rmcd - depth_mbsf, .after = depth_rmcd) |>
    mutate(diff2 = depth_rmcd2 - depth_mbsf2, .after = depth_rmcd2) |>
    mutate(row = 1:n())

  # the right side of the splice table only
  rmcd2 <- rmcd |>
    select(label, link, label2, interval2, depth_mbsf2, depth_rmcd2, diff2, row) |>
    separate(label2, into = c("sitehole", "coretype", "Sec"),
               sep = "-", remove = FALSE) |>
    separate(sitehole, into = c("Site", "H"), sep = -1) |>
    separate(coretype, into = c("Core", "T"), sep = -1) |>
    # we do not rename the interval, may not be the same as in the data!
    mutate(Sec = ifelse(Sec == "7", "7", Sec),
           Sec = ifelse(Sec == "cc", "7", Sec))
#+end_src

#+RESULTS:
: indexing ODP208_1267_rmcd.csv [====================================================] 490.28MB/s, eta:  0s                                                                                                                                            Rows: 61 Columns: 9
: ── Column specification ─────────────────────────────────────────────────────────────────────────────────
: Delimiter: ","
: chr (3): label, link, label2
: dbl (6): interval, depth_mbsf, depth_rmcd, interval2, depth_mbsf2, depth_rmcd2
:
: ℹ Use `spec()` to retrieve the full column specification for this data.
: ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

**** apply the splice table to the magsus data
:PROPERTIES:
:CREATED:  [2023-09-20 Wed 10:43]
:END:
#+begin_src R
  # add Magsus from hole A and B to the same dataframe
  MS <- ODP208_1267_MS_A |>
    mutate(Sec = as.character(Sec)) |>
    bind_rows(ODP208_1267_MS_B) |>
    # add the rcmd splice table
    tidylog::left_join(rmcd |>
                       # make the types teh same
                       mutate(across(c(Site, Core), parse_double)) |>
                       # do NOT match by section, only by core!
                       rename(section = Sec) |>
                       select(top = label, to = label2,
                              Site, H, Core, T, section, interval, depth_mbsf, depth_rmcd, diff, row)) |>
    # add the right-hand side of the splice table
    tidylog::left_join(rmcd2 |>
                       mutate(across(c(Site, Core), parse_double)) |>
                       rename(section2 = Sec) |>
                       select(from = label, bot = label2,
                              Site, H, Core, T, section2, interval2, depth_mbsf2, depth_rmcd2, diff2, row2 = row)) |>
    # I tried the full_joins for both, which adds
    #> 1267A-26H-7	1267B-27X-4	7	10	244.7	275.3	30.6	46
    # and
    #> 1267B-36X-C							61
    # the ties represent jumps to another depth, anything above the jump should be included
    ## mutate(seclsec = Sec < section,
    ##        secesec = Sec == section,
    ##        secgsec = Sec > section,
    ##        topleint = `Top (cm)` <= interval,
    ##        my_rmcd =
    mutate(my_rmcd = case_when(
    (Sec <= section) | ((Sec == section) & (`Top (cm)` <= interval)) ~ `Depth (mbsf)` + diff,
    (Sec >= section2) | ((Sec == section2) & (`Top (cm)` >= interval2)) ~ `Depth (mbsf)` + diff2,
    TRUE ~ NA_real_)) |>
    mutate(on_splice = (Sec < section | ((Sec == section) & (`Top (cm)` <= interval))) &
           (Sec > section2 | ((Sec == section2) & `Top (cm)` >= interval2))) |>
    mutate(on_splice = ifelse(is.na(on_splice), FALSE, on_splice)) |>
    ## print(width = Inf)
    readr::write_csv("out/ODP208_1267_MS.csv")

  # the rmcd splice table goes down to 311 mbsf for hole A, the MS data goes down to 312 mbsf
  # trying it with approx/approxExtrap
  # this is wrong, they shouldn't be stretched!
  ## MS <- ODP208_1267_MS_A |>
  ##   mutate(Sec = as.character(Sec)) |>
  ##   mutate(depth_rmcd = Hmisc::approxExtrap(x = rmcd[rmcd$H == "A", ]$`Depth (mbsf)`,
  ##                              y = rmcd[rmcd$H == "A", ]$depth_rmcd,
  ##                              xout = `Depth (mbsf)`)$y) |>
  ##   ## tail() |>
  ##   ## print(width = Inf)
  ##   bind_rows(
  ##     # the rmcd splice table goes down to 329 mbsf for hole B, the MS data goes down to 329 mbsf
  ##     ODP208_1267_MS_B |>
  ##     mutate(Sec = as.character(Sec)) |>
  ##     mutate(depth_rmcd = Hmisc::approxExtrap(x = rmcd[rmcd$H == "B", ]$`Depth (mbsf)`,
  ##                                             y = rmcd[rmcd$H == "B", ]$depth_rmcd,
  ##                                             xout = `Depth (mbsf)`)$y)
  ##   )

  MS |>
    # I'd like to NOT plot the lines between the core gaps, so I group by Core
    ## add_row(Leg = rep("208", length(lasts)), .after = lasts[1])
    ## rows_insert()
    ggplot(aes(x = my_rmcd, y = `Corrected Suscept.`, colour = H, group = paste(H, Core, T, Sec),
               Sec = Sec)) +
    geom_line(aes(alpha = on_splice))

  ## MS |>
  ##   ggplot(aes(x = `Depth (mbsf)`, y = `Corrected Suscept.`, colour = H, group = paste(H, Core, T))) +
  ##   geom_line(aes(alpha = on_splice))
#+end_src

#+RESULTS:
#+begin_example
Joining with `by = join_by(Site, H, Core, T)`
left_join: added 8 columns (top, to, section, interval, depth_mbsf, …)
rows only in x    2,494
rows only in y  (     1)
matched rows     20,745
                ========
rows total       23,239
Joining with `by = join_by(Site, H, Core, T)`
left_join: added 8 columns (from, bot, section2, interval2, depth_mbsf2, …)
rows only in x    2,510
rows only in y  (     1)
matched rows     20,729
                ========
rows total       23,239
wrote 21.46kB in  0s, 2.14GB/swrote 1.00TB in  0s, 28.44TB/s                                                                                                       > > > > > > > > > > > > > > > > > > > > > . + Warning messages:
1: Using alpha for a discrete variable is not advised.
2: Removed 2230 rows containing missing values (`geom_line()`).
#+end_example

I think that did it!

*** shipboard agemodel [cite:@Zachos2004]
:PROPERTIES:
:CREATED:  [2023-09-20 Wed 09:46]
:END:
http://www-odp.tamu.edu/publications/208_IR/chap_08/c8_f28.htm#554657

#+begin_src R
  agem_sb <- readr::read_tsv("http://www-odp.tamu.edu/publications/208_IR/VOLUME/TABLES/IR208_08/08_T14.TXT",
                             comment = "#", skip = 4)
#+end_src

#+RESULTS:
#+begin_example
indexed 218.00B in  0s, 7.82MB/s                                                                                                       indexed 1.00TB in  0s, 1.41PB/s                                                                                                       New names:
• `` -> `...11`
• `` -> `...12`
• `` -> `...13`
• `` -> `...14`
• `` -> `...15`
• `` -> `...16`
• `` -> `...17`
• `` -> `...18`
• `` -> `...19`
Rows: 66 Columns: 19
── Column specification ─────────────────────────────────────────────────────────────────────────────────
Delimiter: "\t"
dbl (10): Age (Ma), Depth (mcd), LSR, Growth factor, Corrected LSR, Dry density (g/cm3), CaCO3 (wt%),...
lgl  (9): ...11, ...12, ...13, ...14, ...15, ...16, ...17, ...18, ...19

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
Warning message:
One or more parsing issues, call `problems()` on your data frame for details, e.g.:
  dat <- vroom(...)
  problems(dat)
#+end_example

*** agemodel from Neptune database [cite:@Renaudie2020] (only hole B)
:PROPERTIES:
:CREATED:  [2023-09-20 Wed 09:43]
:END:
#+begin_src R
  agem3 <- readr::read_tsv("dat/Renaudie2020/agem.csv")

  agem3 |>
    ggplot(aes(x = `Depth (mbsf)`, y = `Age (Ma)`)) +
    geom_line() +
    geom_line(aes(x = `Depth (mcd)`), data = agem_sb, colour = "red")
#+end_src

#+RESULTS:
: indexing agem.csv [=================================================================] 43.52MB/s, eta:  0s                                                                                                                                            Rows: 22 Columns: 4
: ── Column specification ─────────────────────────────────────────────────────────────────────────────────
: Delimiter: "\t"
: chr (2): Hole, Comment
: dbl (2): Age (Ma), Depth (mbsf)
:
: ℹ Use `spec()` to retrieve the full column specification for this data.
: ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

*** [#B] agemodel from [cite:@Batenburg2018a]
:PROPERTIES:
:CREATED:  [2023-09-20 Wed 09:14]
:END:
depth rmcd from 232 m to 366 m
age from 56 Ma to 69.1 Ma

#+begin_src R
  agem2 <- readr::read_csv("dat/Batenburg2018/site_1267_agemodel.csv") #|>
  ## summarize(d = range(depth_rmcd), a = range(age_ma))
#+end_src

#+RESULTS:
: indexing site_1267_agemodel.csv [==================================================] 173.43MB/s, eta:  0s                                                                                                                                            Rows: 65 Columns: 3
: ── Column specification ─────────────────────────────────────────────────────────────────────────────────
: Delimiter: ","
: chr (1): strat_event
: dbl (2): depth_rmcd, age_ma
:
: ℹ Use `spec()` to retrieve the full column specification for this data.
: ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
*** apply the agemodel to the MS data
:PROPERTIES:
:CREATED:  [2023-09-20 Wed 15:49]
:END:
#+begin_src R
  MS |>
    mutate(age = approx(agem2$depth_rmcd, agem2$age_ma,
                        xout = my_rmcd)$y) |>
    ggplot(aes(x = age, y = `Corrected Suscept.`,
               alpha = on_splice,
               Sec = Sec)) +
    geom_line(aes(colour = H, group = paste(H, Core)))
#+end_src

#+RESULTS:
: Warning messages:
: 1: Using alpha for a discrete variable is not advised.
: 2: Removed 15764 rows containing missing values (`geom_line()`).

**** read in the data and calculate normalized a*/b*
#+begin_src R
  ODP208_1267_color_A <- readr::read_tsv("dat/ODP208_1267_color-reflectance.dat")
  ODP208_1267_color_B <- readr::read_tsv("dat/ODP208_1267_color-reflectance_B.dat")

  # dat is only hole B for now
  dat <- ODP208_1267_color_B |>
    select(depth = `Depth (mbsf)`,
           Lstar = `L*`,
           astar = `a*`,
           bstar = `b*`) |>
    filter(depth >= 285.9) |>
    mutate(aob = scale(astar / bstar)[, 1]) |>
    select(depth, aob, everything())

  # raw data with simple loess curve
  dat |>
    ggplot(aes(x = depth, y = Lstar)) +
    geom_line() +
    geom_line(aes(x = `Depth (mbsf)`, y = `L*`), data = ODP208_1267_color_A, alpha = .2) +
    geom_smooth(method = "loess", span = .2) +
    geom_smooth(method = "gam", color = "orange")
#+end_src

#+RESULTS:
#+begin_example
indexed 0B in  0s, 0B/sindexed 1.00TB in  0s, 55.64TB/s                                                                                                       Rows: 25316 Columns: 15
── Column specification ─────────────────────────────────────────────────────────────────────────────────
Delimiter: "\t"
chr  (4): H, T, Sec, Munsell_HVC
dbl (11): Leg, Site, Core, Top (cm), Depth (mbsf), L*, a*, b*, X, Y, Z

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
indexing ODP208_1267_color-reflectance_B.dat [=====================================] 130.62GB/s, eta:  0s                                                                                                                                            Rows: 13263 Columns: 15
── Column specification ─────────────────────────────────────────────────────────────────────────────────
Delimiter: "\t"
chr  (4): H, T, Sec, Munsell_HVC
dbl (11): Leg, Site, Core, Top (cm), Depth (mbsf), L*, a*, b*, X, Y, Z

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
+ + `geom_smooth()` using formula = 'y ~ x'
`geom_smooth()` using formula = 'y ~ s(x, bs = "cs")'
#+end_example
***** use taner filters
:PROPERTIES:
:CREATED:  [2023-09-19 Tue 12:16]
:END:
#+begin_src R
  f100 <- dat |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::taner(flow = .07, fhigh = 0.9, xmax = 3) |>
    as_tibble()

  f405 <- dat |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::taner(flow = .07, fhigh = 0.25, xmax = 1) |>
    as_tibble()

  ## f100_2 <- dat |>
  ##   astrochron::linterp(genplot = FALSE) |>
  ##   astrochron::bandpass(flow = .1, fhigh = .5, win = 1, xmax = 5)
#+end_src

#+RESULTS:
#+begin_example
----- TANER BANDPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= 11.30448
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
#+end_example

***** get the maxima of the 405 kyr filter
:PROPERTIES:
:CREATED:  [2023-09-19 Tue 12:17]
:END:
#+begin_src R
  pk405 <- f405 |>
    astrochron::peak() |>
    as_tibble() |>
    mutate(
      n_cyc = 0:n(),
      age_405 = 65940 + n_cyc * 405) # ZB18a eq 2 or 66.96 for eq 3

  pk405 |>
    ggplot(aes(x = Location, y = age_405)) +
    geom_line() + geom_point()

  dat <- dat |>
    mutate(
      age = astrochron::tune(dat,
                   controlPts = pk405 |>
                     select(depth = Location, age_405),
                   extrapolate = TRUE,
                   genplot = FALSE)$X1)

  dat |>
    ggplot(aes(x = age, y = aob)) +
    geom_line()

  dat |>
    select(age, aob) |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::mtm(xmax = .06)
#+end_src

#+RESULTS:
#+begin_example
----- FINDING MAXIMA OF PEAKS, FILTERING AT THRESHOLD VALUE -----
 ,* Number of data points= 1733
 ,* Number of columns= 2
 ,* Identifying maxima of peaks
 ,* Number of peaks identified= 10

 ,* No filtering of peaks applied.
Error in `mutate()`:
ℹ In argument: `n_cyc = 0:n()`.
Caused by error:
! `n_cyc` must be size 10 or 1, not 11.
Run `rlang::last_trace()` to see where the error occurred.
+ + ----- TUNING STRATIGRAPHIC SERIES -----
 ,* Number of data points= 2794
 ,* Number of time control points= 10
 ,* Sorting datasets into ensure increasing order, removing empty entries

,**** WARNING: duplicate depth/height datum found in dat

 ,* Mean sampling interval= 1.332388
 ,* Median sampling interval= 1.808036
 ,* Maximum sampling interval= 7.714286
 ,* Minimum sampling interval= 0

----- PERFORMING Multitaper Spectral Analysis -----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 2794
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 1.808036
 ,* New number of samples= 2059
 ,* Number of data points in stratigraphic series: 2059
 ,* Stratigraphic series length (space or time): 3720.937
 ,* Sampling interval (space or time): 1.808036
 ,* Will use default setting of 5 DPSS tapers
 ,* Mean value subtracted= 0.1015833
 ,* Linear trend NOT subtracted
 ,* Nyquist frequency: 0.2765432
 ,* Rayleigh frequency: 0.000268619
 ,* MTM Power spectrum bandwidth resolution (halfwidth): 0.0008058569
 ,* Padded to 10296 points

 ,* Searching for significant spectral peaks that satisfy 90 % CL
     requirements outlined in Meyers (2012):
 ,* Number of significant F-test peaks identified = 32
ID  / Frequency / Period / Harmonic_CL / Rednoise_CL
1   0.0006983414   1431.964   94.44193   100
2   0.05661938   17.6618   93.88804   72.1348
3   0.07939605   12.59509   96.82607   99.47927
4   0.08933399   11.19395   91.71181   99.89702
5   0.09696202   10.31332   96.70337   87.05542
6   0.1005612   9.944196   99.55621   73.2013
7   0.1086727   9.201945   97.34754   98.66957
8   0.1129164   8.856106   97.60775   85.1843
9   0.114528   8.73149   94.97761   84.96299
10   0.1195775   8.362774   99.83013   88.32753
11   0.122156   8.186251   99.41092   98.80402
12   0.1250568   7.996364   94.28173   88.18916
13   0.127689   7.831525   94.57301   81.88665
14   0.1369824   7.30021   97.90853   98.13951
15   0.1387551   7.206944   97.25249   92.8674
16   0.1409575   7.094335   96.86739   94.83192
17   0.1489079   6.715561   92.28015   95.59369
18   0.1514864   6.601254   94.20763   93.80038
19   0.159383   6.274195   97.75216   99.2873
20   0.1655606   6.040083   92.94299   87.10266
21   0.1705565   5.863161   95.31809   73.97557
22   0.173135   5.775841   96.94309   84.24478
23   0.1749614   5.715547   92.92138   56.35226
24   0.1773787   5.637655   99.02583   98.2947
25   0.1781308   5.613853   97.85763   98.6933
26   0.1792052   5.580197   98.92372   86.87813
27   0.182482   5.479993   98.91651   79.7809
28   0.1835564   5.447918   97.99307   63.96113
29   0.1890357   5.290007   99.94708   66.57191
30   0.1905398   5.248248   98.70234   89.36756
31   0.2014984   4.962819   91.57414   75.61101
32   0.2053661   4.869353   93.86716   93.96291
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
#+end_example

***** remove long-term trends in the depth domain
:PROPERTIES:
:CREATED:  [2023-09-21 Thu 11:39]
:END:
#+begin_src R
  fit_loess <- loess(aob ~ depth, data = dat, span = .75)
  fit_gam <- mgcv::gam(aob ~ s(depth, bs = "cs"), data = dat)

  lp <- dat |>
    select(depth, aob## Lstar_scl
           ) |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::lowpass(fcut = 1 / 15) # how do you decide which frequency to cull?
  # this is linearly interpolated so it can't go into the other df

  # let's see how sensitive it is to the span or to size of the rolling mean
  dat <- dat |>
    mutate(
      # there are several methods of calculating a rolling average
      ## ma = roll::roll_mean() # that's left-aligned
      ## ma = zoo::rollmean(Lstar, k = 33, align = "center", na.pad = TRUE),
      # I prefer the slider implementation, it's FAAAST
      # I've played around with the size of the window. If I make it larger,
      # more low-frequency peaks are preserved.
      ma = slider::slide_mean(aob, before = 3, after = 3),
      loess = predict(fit_loess),
      gam = predict(fit_gam),
      scl = scale(Lstar)[, 1],
      loess_scl = scale(aob - loess)[, 1],
      gam_scl = scale(aob - loess)[, 1],
      ma_scl = scale(aob - ma)[, 1])

  dat |>
    ggplot(aes(x = depth, y = aob)) +
    geom_line(alpha = .3) +
    geom_line(aes(y = loess), colour = "orange") +
    geom_line(aes(y = gam), colour = "red") +
    geom_line(aes(y = ma), colour = "indianred")

  dat |>
    ggplot(aes(x = depth, y = aob)) +
    geom_line() +
    geom_line(aes(y = loess_scl + 3), colour = "orange") +
    geom_line(aes(y = gam_scl + 6), colour = "red") +
    geom_line(aes(y = ma_scl + 9), colour = "indianred")
#+end_src

#+RESULTS:
#+begin_example
----- LOWPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= 0.01953956
 ,* 5 pos/neg frequency pairs and f(0) will be bandpassed
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
#+end_example

***** do mtm analysis  in the depth domain
:PROPERTIES:
:CREATED:  [2023-09-21 Thu 11:55]
:END:
#+begin_src R
  dat |>
    drop_na() |>
    select(depth,
           ## aob
           ## Lstar,
           ## loess_scl
           gam_scl
           ## ma_scl
           ) |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::mtm(output = 1, xmax = 10) |>
    as_tibble()
#+end_src

#+RESULTS:
#+begin_example
----- PERFORMING Multitaper Spectral Analysis -----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points in stratigraphic series: 1733
 ,* Stratigraphic series length (space or time): 43.3
 ,* Sampling interval (space or time): 0.025
 ,* Will use default setting of 5 DPSS tapers
 ,* Mean value subtracted= -0.01233601
 ,* Linear trend NOT subtracted
 ,* Nyquist frequency: 20
 ,* Rayleigh frequency: 0.02308136
 ,* MTM Power spectrum bandwidth resolution (halfwidth): 0.06924409
 ,* Padded to 8666 points

 ,* Searching for significant spectral peaks that satisfy 90 % CL
     requirements outlined in Meyers (2012):
 ,* Number of significant F-test peaks identified = 45
ID  / Frequency / Period / Harmonic_CL / Rednoise_CL
1   0.04154166   24.07222   99.99332   94.47068
2   0.3507962   2.850658   95.40414   99.34413
3   0.549273   1.820588   99.92272   90.23704
4   0.6600508   1.515035   91.19649   59.47227
5   2.506347   0.3989871   99.89627   96.12123
6   2.594046   0.3854982   92.44308   83.04771
7   4.264943   0.2344697   92.16859   88.38001
8   6.106624   0.1637566   99.97574   64.24839
9   7.957535   0.1256671   98.02938   84.56849
10   8.156012   0.1226089   99.56273   93.39497
11   8.636049   0.1157937   93.77362   89.15927
12   9.162243   0.1091436   94.5318   94.81719
13   9.254558   0.1080549   97.12304   91.02518
14   9.780752   0.1022416   99.23594   89.6252
15   10.58389   0.09448321   97.63208   95.19877
16   11.0547   0.09045929   95.38273   71.77478
17   11.17009   0.08952479   93.31012   94.37374
18   11.23933   0.08897331   94.41622   69.61838
19   11.34549   0.08814076   97.56208   82.46031
20   11.65474   0.08580198   96.46021   92.3349
21   12.3748   0.0808094   95.08567   97.70813
22   12.6379   0.0791271   93.61368   93.78243
23   12.91946   0.07740264   93.58463   98.73064
24   13.021   0.07679901   99.36298   62.93381
25   13.99954   0.07143093   93.04069   69.35024
26   14.09647   0.07093975   99.0737   99.23679
27   14.3688   0.06959525   98.67312   65.13055
28   14.43803   0.06926151   98.13179   88.08993
29   14.62266   0.06838699   93.05752   71.92128
30   14.81652   0.06749221   93.207   97.05258
31   14.92269   0.06701206   98.81422   88.95434
32   15.26425   0.06551255   90.32211   64.95676
33   15.31964   0.06527569   90.27383   91.41624
34   15.62428   0.06400295   97.41725   85.49958
35   16.00277   0.06248918   97.92565   69.38568
36   17.09208   0.05850662   94.68049   88.8287
37   17.56751   0.05692328   94.9835   98.48725
38   17.70598   0.0564781   95.94265   67.11723
39   17.7706   0.05627273   94.22985   82.84472
40   17.80291   0.0561706   94.13535   73.71871
41   17.91369   0.05582324   99.42751   89.83134
42   18.30141   0.05464061   90.21182   73.95803
43   18.47681   0.05412191   99.35286   58.34943
44   18.5645   0.05386624   99.42883   60.71567
45   19.87076   0.0503252   99.8528   87.81698
# A tibble: 4,332 × 8
   Frequency   Power Harmonic_CL AR1_CL AR1_fit AR1_90_power AR1_95_power AR1_99_power
       <dbl>   <dbl>       <dbl>  <dbl>   <dbl>        <dbl>        <dbl>        <dbl>
 1   0.00462 0.00804        7.33   99.8 0.00296      0.00473      0.00542      0.00687
 2   0.00923 0.00779        1.57   99.7 0.00296      0.00473      0.00542      0.00687
 3   0.0138  0.00746        1.54   99.5 0.00296      0.00473      0.00542      0.00687
 4   0.0185  0.00706       19.9    99.2 0.00296      0.00473      0.00542      0.00687
 5   0.0231  0.00658       57.2    98.6 0.00296      0.00473      0.00542      0.00687
 6   0.0277  0.00608       89.2    97.5 0.00296      0.00473      0.00542      0.00687
 7   0.0323  0.00568       99.3    96.2 0.00296      0.00473      0.00542      0.00687
 8   0.0369  0.00546      100.     95.2 0.00296      0.00473      0.00542      0.00687
 9   0.0415  0.00532      100.     94.5 0.00296      0.00473      0.00542      0.00687
10   0.0462  0.00512       99.5    93.2 0.00296      0.00473      0.00542      0.00687
# ℹ 4,322 more rows
# ℹ Use `print(n = ...)` to see more rows
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
#+end_example

***** bandpass filtering in the depth domain
:PROPERTIES:
:CREATED:  [2023-09-21 Thu 11:56]
:END:
#+begin_src R
  # I like gam I think?
  filt_bp_2.4 <- dat |>
    drop_na() |>
    select(depth, gam_scl) |>
    astrochron::linterp(genplot = FALSE) |>
    # this is peak no 1
    astrochron::bandpass(flow = 0.042 - .15 * .042, fhigh = 0.042 + .15 * .042, win = 1, xmax = 1) |> # gaussian window
    ## astrochron::taner(flow = 0, fhigh = .3, xmax = 1) |> # taner window
    as_tibble()

  filt_bp_405 <- dat |>
    drop_na() |>
    select(depth, gam_scl) |>
    astrochron::linterp(genplot = FALSE) |>
    ## astrochron::bandpass(flow = 0, fhigh = .3, win = 0, xmax = 1) |> # uniform window
    # this is peak no 2, no 3 = 0.5
    astrochron::bandpass(flow = 0.35 - .15 * .35, fhigh = 0.35 + .15 * .35, win = 1, xmax = 1) |> # gaussian window
    ## astrochron::taner(flow = 0, fhigh = .3, xmax = 1) |> # taner window
    as_tibble()

  filt_bp_100 <- dat |>
    drop_na() |>
    select(depth, gam_scl) |>
    astrochron::linterp(genplot = FALSE) |>
    ## astrochron::bandpass(flow = 0, fhigh = .3, win = 0, xmax = 1) |> # uniform window
    # this is peak no. 5/6
    astrochron::bandpass(flow = 2.51 - .15 * 2.51, fhigh = 2.51 + .15 * 2.51, win = 1, xmax = 10) |> # gaussian window
    ## astrochron::taner(flow = 0, fhigh = .3, xmax = 1) |> # taner window
    as_tibble()

  filt_bp_prec <- dat |>
    drop_na() |>
    select(depth, gam_scl) |>
    astrochron::linterp(genplot = FALSE) |>
    ## astrochron::bandpass(flow = 0, fhigh = .3, win = 0, xmax = 1) |> # uniform window
    # this is peak no. 9
    astrochron::bandpass(flow = 7.96 - .15 * 7.69, fhigh = 7.96 + .15 * 7.96, win = 1, xmax = 10) |> # gaussian window
    ## astrochron::taner(flow = 0, fhigh = .3, xmax = 1) |> # taner window
    as_tibble()

  filt_hb <- filt_bp_prec |>
    astrochron::hilbert(genplot = TRUE, output = TRUE) |>
    ## astrochron::peak() |>
    as_tibble()
#+end_src

#+RESULTS:
#+begin_example
----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= -0.01994842
 ,* Center of bandpass filter = 2.5
 ,* 86 pos/neg frequency pairs will be bandpassed
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= -0.01994842
 ,* Center of bandpass filter = 4
 ,* 86 pos/neg frequency pairs will be bandpassed
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= -0.01994842
 ,* Center of bandpass filter = 6.7
 ,* 86 pos/neg frequency pairs will be bandpassed
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
----- PERFORMING HILBERT TRANSFORM ON STRATIGRAPHIC SERIES -----
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= -0.01987432
#+end_example

**** add rmcd depth and create splice for colour data
:PROPERTIES:
:CREATED:  [2023-09-21 Thu 11:39]
:END:
#+begin_src R
  col <- ODP208_1267_color_A |>
    mutate(Sec = as.character(Sec)) |>
    bind_rows(ODP208_1267_color_B) |>
    get_rmcd() |>
    # this CC isn't included correctly
    mutate(on_splice = if_else(H == "B" & Core == 33 & Sec == "CC", TRUE, on_splice))

  col |>
    ggplot(aes(x = my_rmcd, y = `L*`, colour = H, group = paste(H, Core, T, Sec),
               Sec = Sec)) +
    geom_line(aes(alpha = on_splice))
#+end_src

#+RESULTS:
#+begin_example
indexing ODP208_1267_rmcd.csv [====================================================] 206.14MB/s, eta:  0s                                                                                                                                            Rows: 61 Columns: 9
── Column specification ─────────────────────────────────────────────────────────────────────────────────
Delimiter: ","
chr (3): label, link, label2
dbl (6): interval, depth_mbsf, depth_rmcd, interval2, depth_mbsf2, depth_rmcd2

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
Joining with `by = join_by(Site, H, Core, T)`
left_join: added 8 columns (top, to, section, interval, depth_mbsf, …)
rows only in x    3,908
rows only in y  (     1)
matched rows     34,671
                ========
rows total       38,579
Joining with `by = join_by(Site, H, Core, T)`
left_join: added 8 columns (from, bot, section2, interval2, depth_mbsf2, …)
rows only in x    3,975
rows only in y  (     1)
matched rows     34,604
                ========
rows total       38,579
+ + Warning messages:
1: Using alpha for a discrete variable is not advised.
2: Removed 3685 rows containing missing values (`geom_line()`).
#+end_example

**** apply agemodel to colour data
:PROPERTIES:
:CREATED:  [2023-09-21 Thu 12:09]
:END:
#+begin_src R
  col <- col |>
    mutate(age = approx(agem2$depth_rmcd, agem2$age_ma,
                        xout = my_rmcd)$y)

  col |>
    ggplot(aes(x = age, y = `L*`,
               alpha = on_splice,
               Sec = Sec)) +
    geom_line(aes(colour = H, group = paste(H, Core)))
#+end_src

#+RESULTS:
: Warning messages:
: 1: Using alpha for a discrete variable is not advised.
: 2: Removed 25569 rows containing missing values (`geom_line()`).

